const { default: Link } = require("next/link");

let books$ = [
  {
    title: "الاخلاص",
    description: `جَاءَ هٰذَا الكِتَابُ لِبَيَانِ أَهَمِّيَّةِ الإِخْلَاصِ فِي العِبَادَاتِ وَالأَعْمَالِ، وَذِكْرِ فَضَائِلِهِ وَصُوَرِهِ، وَتَبْيِينِ خَطَرِ الرِّيَاءِ عَلَى الأَعْمَالِ، مَعَ بَيَانِ أَسْبَابِهِ وَطُرُقِ مُعَالَجَتِهِ، وَذٰلِكَ مِمَّا يَعُودُ بِالنَّفْعِ عَلَى المُسْلِمِ فِي تَصْحِيحِ أَعْمَالِهِ وَسَلَامَةِ دِينِهِ، وَتَحْقِيقِ النَّجَاةِ عِنْدَ اللهِ عَزَّ وَجَلَّ`,
    img: `/images/book images/الاخلاص.png`,
    link: `/files/الاخلاص.pdf`,
  },
  {
    title: "البكاء من خشية الله",
    description: ` كِتَابٌ يَتَضَمَّنُ فَضْلَ البُكَاءِ مِنْ خَشْيَةِ اللهِ، وَيُوَضِّحُ السَّبِيلَ إِلَى ذٰلِكَ، مُعَالِجًا العَوَائِقَ قَدْرَ المُسْتَطَاعِ، ذَاكِرًا بَعْضَ النُّصُوصِ وَالآثَارِ فِي بُكَاءِ النَّبِيِّ ﷺ وَأَصْحَابِهِ رَضِيَ اللهُ عَنْهُمْ`,
    img: `/images/book images/البكاء من خشية الله.png`,
    link: `/files/البكاء من خشية الله.pdf`,
  },
  {
    title: "التحذير من الشيطان",
    description: `يَتضَمّن هٰذَا الكِتَابَ التَّحْذِيرَ مِنْ خَطَرِ الشَّيْطَانِ، وَبَيَانَ عِظَمِ أَثَرِهِ، وَإِيضَاحَ مَكَايِدِهِ لِبَنِي آدَمَ، وَمَا يَجْلِبُهُ إِغْوَاؤُهُ مِنَ المَفَاسِدِ، كَمَا يَتَنَاوَلُ الأُمُورَ الَّتِي تُبْعِدُ الشَّيْطَانَ وَتُنَفِّرُهُ، وَيَتَضَمَّنُ فَصْلًا فِي صِيَغِ الِاسْتِعَاذَةِ، وَمَا فِي سُورَةِ الفَلَقِ مِنْ كُنُوزٍ وَمَعَانٍ عَظِيمَةٍ، إِلَى غَيْرِ ذٰلِكَ مِنَ الأَسْبَابِ الَّتِي تَكُونُ حِصْنًا لِلْعَبْدِ مِنَ الشَّيْطَانِ بِإِذْنِ اللهِ تَعَالى`,
    img: `/images/book images/التحذير من الشيطان.png`,
    link: `/files/التحذير من الشيطان.pdf`,
  },
  {
    title: "الصلاة",
    description: `كانَتِ الصَّلَاةُ قُرَّةَ عَيْنِ النَّبِيِّ ﷺ، وَمَصْدَرَ الطُّمَأْنِينَةِ وَالسَّكِينَةِ، وَهِيَ أَعْظَمُ أَرْكَانِ الإِسْلَامِ بَعْدَ الشَّهَادَتَيْنِ، وَأَوَّلَ مَا يُحَاسَبُ عَلَيْهِ العَبْدُ يَوْمَ القِيَامَةِ. وَقَدْ عَمِدَ المُؤَلِّفُ – حَفِظَهُ اللهُ – فِي هٰذَا الكِتَابِ إِلَى بَيَانِ عِظَمِ مَكَانَةِ الصَّلَاةِ ، وَمَا تَشْتَمِلُ عَلَيْهِ مِنْ وَاجِبَاتٍ وَأَحْكَامٍ يَنْبَغِي العِنَايَةُ بِهَا، وَمِنْ أَبْرَزِهَا ضَرُورَةُ مُوَافَقَتِهَا لِصَلَاةِ النَّبِيِّ ﷺ فِي هَيْئَتِهَا وَأَفْعَالِهَا ، ثم جعل المُؤَلِّفُ فَصْلًا لِلْحَدِيثِ عَنْ حَقِيقَةِ الخُشُوعِ فِي الصَّلَاةِ وَآثَارِهِ التَّرْبَوِيَّةِ وَالإِيمَانِيَّةِ، وَذَكَرَ أَهَمَّ أَسْبَابِهِ، وَفِي مُقَدِّمَتِهَا اسْتِحْضَارُ ذِكْرِ المَوْتِ. ثُمَّ تَنَاوَلَ مَسْأَلَةَ المُحَافَظَةِ عَلَى الصَّلَاةِ فِي أَوْقَاتِهَا، وَأَدَائِهَا فِي جَمَاعَةٍ، إِضَافَةً إِلَى جُمْلَةٍ مِنَ المَسَائِلِ المُتَعَلِّقَةِ بِتَحْقِيقِ إِقَامَةِ الصَّلَاةِ عَلَى الوَجْهِ المَشْرُوعِ مِمَّا له أَثَرٌ عظيمٌ في تهذيبِ نَفْسِ المؤمنِ وزيادةِ إيمانهِ، حتّى يَبلُغَ دَرَجَةَ الإحسانِ `,
    img: `/images/book images/الصلاة.png`,
    link: `/files/الصلاة.pdf`,
  },
  {
    title: "الغيبة",
    description: `كتاب يتناول شرحًا مبسطًا عن الغيبة`,
    img: `/images/book images/الغيبة.png`,
    link: `/files/الغيبة.pdf`,
  },
  {
    title: "الفصل المبين",
    description: `كتاب يتناول شرحًا مبسطًا عن الفصل المبين`,
    img: `/images/book images/الفصل المبين.png`,
    link: `/files/الفصل المبين.pdf`,
  },
  {
    title: "القبر عذابه ونعيمه",
    description: `يَتَكَلَّمُ هٰذَا الكِتَابُ عَنْ أَحْوَالِ الإِنسَانِ بَعْدَ مَوْتِهِ في القَبْرِ، فَيَتَضَمَّنُ البَحْثَ فِيمَا يَحْصُلُ لِلْمُؤْمِنِ مِنَ النَّعِيمِ في قبره، و عِندَ قَبْضِ رُوحِهِ وَحِينَ مَجِيءِ المَوْتِ، وَفِيمَا يَقَعُ لِلْكَافِرِ مِنَ العَذَابِ فِي قَبْرِهِ ، و عِنْدَ القَبْضِ وَعِنْدَ المَوْتِ، وَمَا يَكُونُ مِنْ عَذَابٍ لِبَعْضِ العُصَاةِ فِي القَبْرِ، كَمَا يَتَضَمَّنُ ذِكْرَ حَيَاةِ البَرْزَخِ وَمَا يَنْفَعُ المُؤْمِنَ بَعْدَ مَوْتِهِ`,
    img: `/images/book images/القبر عذابه ونعيمه.png`,
    link: `/files/القبر عذابه ونعيمه.pdf`,
  },
  {
    title: "المظهرية الجوفاء",
    description: ` يَتَضَمَّنُ الكِتَابُ ذَم المُظَاهَرِيَّةِ المُعَاصِرَةِ، وَكَثِيرًا مِنْ أَسَالِيبِهَا فِي العَصْرِ الحَدِيثِ، كَالمُظَاهَرِيَّةِ فِي الأَفْرَاحِ، وَالمَآتِمِ، وَالزِّيَارَاتِ، وَيَتَنَاوَلُ حَالَ مَسَاجِدِ اليَوْمِ، مُقَارِنًا إِيَّاهَا بمَسْجِدِ النَّبِيِّ ﷺ، وَكَيْفَ كَانَ حَالُ سَلَفِ هٰذِهِ الأُمَّةِ فِي لزوم الكتاب و السُّنَّة`,
    img: `/images/book images/المظهرية الجوفاء.png`,
    link: `/files/المظهرية الجوفاء.pdf`,
  },
  {
    title: "فيض الرحمن في مفكرة رمضان",
    description: `يَتَضَمَّنُ هٰذَا الكِتَابُ وَظَائِفَ شَهْرِ رَمَضَانَ المُبَارَكِ وَأَعْمَالَهُ، وَقَدْ جَعَلَ الشَّيْخُ لِكُلِّ يَوْمٍ مِنْ أَيَّامِ رَمَضَانَ صَفْحَتَيْنِ، تَضُمَّنِ التَّذْكِيرَ بِفَضْلِهِ، وَأَحْكَامِهِ، وَآدَابِهِ، وَفَضْلِ تِلَاوَةِ القُرْآنِ العَظِيمِ، وَالصَّدَقَاتِ، وَمَا يَلْزَمُ العِيدَ مِنَ البِرِّ وَالصِّلَةِ وَغَيْرِهَا مِنَ الحُقُوقِ`,
    img: `/images/book images/فيض الرحمن في مفكرة رمضان .png`,
    link: `/files/فيض الرحمن في مفكرة رمضان .pdf`,
  },
  {
    title: "وشيُ الحلل في مراتب العلم والعمل",
    description: `جَاءَ فِي هٰذَا الكِتَابِ تَفْصِيلُ حَدِيثِ النَّبِيِّ ﷺ: «مَاذَا عَمِلَ فِيمَا عَلِمَ»، فَجَاءَ فِيهِ بَيَانُ أَهَمِّيَّةِ العِلْمِ مَعَ العَمَلِ، وَبَيَانُ فَضْلِ العِلْمِ وَمَنْزِلَتِهِ، وَأَهَمِّيَّةِ العَمَلِ بِهِ، مُبَيِّنًا خَطَرَ تَرْكِ العَمَلِ بِالعِلْمِ، وَمَعَالِمَ العِلْمِ النَّافِعِ وَأَمَارَاتِهِ، وَخُتِمَ الكِتَابُ بِنُقُولٍ مُنْتَقَاةٍ لِلْخَطِيبِ البَغْدَادِيِّ رَحِمَهُ اللهُ مِنْ كِتَابِهِ «اقْتِضَاءُ العِلْمِ العَمَلَ»`,
    img: `/images/book images/اولويات العلم.png`,
    link: `/files/اولويات العلم.pdf`,
  },
  {
    title: "تسوية الصفوف",
    description: `كتاب يتناول شرحًا مبسطًا عن تسوية الصفوف`,
    img: `/images/book images/تسوية الصفوف.png`,
    link: `/files/تسوية الصفوف.pdf`,
  },
  {
    title: "سورة المطففين",
    description: `كتاب يتناول شرحًا مبسطًا عن سورة المطففين`,
    img: `/images/book images/سورة المطففين.png`,
    link: `/files/سورة المطففين.pdf`,
  },
  {
    title: "كيف تحكم نفسك",
    description: `كتاب يتناول شرحًا مبسطًا عن كيف تحكم نفسك`,
    img: `/images/book images/كيف تحكم نفسك.png`,
    link: `/files/كيف تحكم نفسك.pdf`,
  },
  {
    title: "مصيبة موت النبي صلى الله عليه وسلم",
    description: ` كِتَابٌ يَتَكَلَّمُ عَنْ عِظَمِ مُصِيبَةِ مَوْتِ النَّبِيِّ ﷺ، وَأَثَرِ هٰذِهِ المُصِيبَةِ عَلَى المُجْتَمَعِ وَالفَرْدِ`,
    img: `/images/book images/مصيبة موت النبي.png`,
    link: `/files/مصيبة موت النبي.pdf`,
  },
  {
    title: "وصية مودع",
    description: `يتناول هذا الكتابُ تأمّلاتٍ علميّةً وشرحًا منهجيًّا لوصيّة النبيِّ ﷺ التي وجّهها وكانت وصيّةَ المودّع، لما اشتملت عليه من أصول الهداية والاستقامة. ويعرض الشيخ مضامين هذه الوصيّة من حيث دلالاتها العقديّة والتربويّة، وما تضمنته من الإرشاد إلى أسباب النجاة ،و اشتملت الوصيّة على الأمر بالسمع والطاعة لولاة الأمر ما لم يأمروا بمعصية ، والتحذير من الافتراق ومخالفة الكتاب والسنّة ومنهج السلف الصالح، وبيان خطر مسالك أهل البدع والضلال `,
    img: `/images/book images/وصية مودع.png`,
    link: `/files/وصية مودع.pdf`,
  },
  {
    title: "فتح العليم في شرح أدعية وأذكار الصلاة من التكبير إلى السجود",
    description: `كتاب يتناول شرحًا مبسطًا عن فتح العليم في شرح أدعية وأذكار الصلاة من التكبير إلى السجود`,
    img: `/images/book images/فتح العليم في شرح أدعية وأذكار الصلاة من التكبير إلى السجود.png`,
    link: `/files/فتح العليم في شرح أدعية وأذكار الصلاة من التكبير إلى السجود.pdf`,
  },
  //   **add more books accourding to this format**
  //   {
  //     title: "",
  //     description: ``,
  //     img: `/images/book images/`,
  //     link: `/files/`,
  //   },
  //
];
let counter=0
let books= books$.map((book)=>{
    return{
        id:counter++,
        title:book.title,
        description:book.description,
        img:book.img,
        link:book.link
    }
})
export default books