let fatawas$ = [
  {
    title: "ما حكم من سب الله؟ وهل تطلق زوجته أم لا؟",
    body: `سب الله - تعالى - من نواقض الإسلام، وهو كفر مخرج من الدين، فمن سب الله - تعالى - يكفر كفرا مخرجا من الدين، إذا كان مختارا غير مكره، قاصدا غير ذاهل، عالما غير جاهل بذلك.

وهل تطلق زوجته؟ عند تأملي المسألة رأيت من المناسب أن أنقل قول سماحة الشيخ عبد العزيز ابن باز مختصرا:

لا يسمى طلاقا، بل تفريقا يفرق بينهما من غير طلاق، وتحرم عليه، فإن تاب وهي في العدة رجعت إليه من دون حاجة إلى شيء، فلا يلزمه تجديد العقد.

وإذا انقضت عدتها ولم يتب فلها أن تنكح من شاءت، لأنه بمثابة الطلاق فإن الله - تعالى - حرم نكاح الكافر من المسلمة.

فإن تاب وأراد أن يتزوجها بعد العدة فلا بأس والأحوط أن يكون بعقد جديد، خروجا من خلاف العلماء والله - تعالى أعلم.`,
  },
  {
    title: "ما حكم السعي وراء الشهرة؟",
    body: `سعي وراء الشهرة خطر، ليكن هم الإنسان مرضاة الله؛ لا حب الظهور والشهرة

حب الرياء والسمعة سبيل النار، والإخلاص سبيل النجاة، هذا في أمور العبادات.

وفي الحديث:

إن الله يحب العبد التقي الغني الخفي.`,
  },
  {
    title: "ما حكم الاختلاط للضرورة في العمل ؟",
    body: `المحظور من الاختلاط ما يجر للفتنة؛ من عدم غض البصر المفضي إلى مالا تحمد عقباه. ومع مضي الأيام يألف الإنسان المنكر، وهذا يرتبط بطبيعة النساء المتواجدة في العمل وغيره، ماذا تلبس وكيف تتصرف ...

في حال غض البصر، وتحقيق الأمر بالمعروف والنهي عن المنكر، وعدم الانجرار للفتنة يجوز هذا العمل، والا فلا.

والسلامة لا يعد لها شيء`,
  },
  {
    title: "ما حكم وضع صور النساء في الإعلانات التجارية ؟",
    body: `المرأة في الإسلام مكرمة، وليست سلعة كما هو الشأن في بلاد الكفر، فلا يحل وضع صور النساء على الإعلانات.`,
  },
  {
    title: "متى يجوز للمسلم أن يأخذ قرضاً من البنك ؟",
    body: `لا يحل أخذ قرض من البنك؛ إذا كان بزيادة ربوية، والنصوص في تحريم الربا معروفة ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب.`,
  },
  {
    title: "مَا حُكْمُ مَنْعِ زَكَاةِ الْمَالِ؟",
    body: `الْحَمْدُ لِلَّهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، أَمَّا بَعْدُ:

عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:
«مَا مِنْ صَاحِبِ ذَهَبٍ وَلَا فِضَّةٍ لَا يُؤَدِّي مِنْهَا حَقَّهَا، إِلَّا إِذَا كَانَ يَوْمُ الْقِيَامَةِ، صُفِّحَتْ لَهُ صَفَائِحُ مِنْ نَارٍ، فَأُحْمِيَ عَلَيْهَا فِي نَارِ جَهَنَّمَ، فَيُكْوَى بِهَا جَنْبُهُ وَجَبِينُهُ وَظَهْرُهُ، كُلَّمَا بَرَدَتْ أُعِيدَتْ لَهُ، فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ، حَتَّى يُقْضَى بَيْنَ الْعِبَادِ، فَيَرَى سَبِيلَهُ، إِمَّا إِلَى الْجَنَّةِ، وَإِمَّا إِلَى النَّارِ» [مُتَّفَقٌ عَلَيْهِ].

وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:
«مَنْ آتَاهُ اللَّهُ مَالًا فَلَمْ يُؤَدِّ زَكَاتَهُ، مُثِّلَ لَهُ مَالُهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ، لَهُ زَبِيبَتَانِ، يُطَوَّقُهُ يَوْمَ الْقِيَامَةِ، ثُمَّ يَأْخُذُ بِلَهْزِمَتَيْهِ -يَعْنِي بِشِدْقَيْهِ- ثُمَّ يَقُولُ: أَنَا مَالُكَ، أَنَا كَنْزُكَ» [رَوَاهُ الْبُخَارِيُّ].

وَمَنْ مَنَعَهَا فَإِنَّ الْحَاكِمَ يَأْخُذُهَا مِنْهُ، وَيَأْخُذُ مَعَهَا نِصْفَ مَالِهِ؛ لِقَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:
«وَمَنْ مَنَعَهَا فَإِنَّا آخِذُوهَا وَشَطْرَ مَالِهِ».

وَإِنْ كَانَ مَانِعُو الزَّكَاةِ أَصْحَابَ شَوْكَةٍ - أَيْ قُوَّةٍ وَسِلَاحٍ -كَمَا حَصَلَ فِي زَمَنِ أَبِي بَكْرٍ - رَضِيَ اللَّهُ عَنْهُ- فَإِنَّهُمْ يُقَاتَلُونَ عَلَى ذَلِكَ حَتَّى يُؤَدُّوهَا، كَمَا فَعَلَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ`,
  },
  {
    title:
      "مَا حُكْمُ إِخْرَاجِ زَكَاةِ الْمَالِ طَعَامًا أَوْ شَرَابًا (الطُّرُودِ)؟",
    body: `زَكَاةُ الْمَالِ لَا تُخْرَجُ إِلَّا مَالًا، وَلَا يَجُوزُ إِخْرَاجُهَا طَعَامًا أَوْ شَرَابًا أَوْ أَثَاثًا.

وَمِنَ الْغَرِيبِ أَنَّ بَعْضَهُمْ يُخْرِجُ زَكَاةَ الْمَالِ طَعَامًا وَشَرَابًا، وَيُخْرِجُ صَدَقَةَ الْفِطْرِ مَالًا`,
  },
  {
    title:
      "مَا حُكْمُ حَجْزِ الْمَكَانِ فِي الصَّلَاةِ؟ وَهَلْ يَجُوزُ حَجْزُهُ لِمَنْ أَرَادَ الْإِفْطَارَ ثُمَّ الرُّجُوعَ؟",
    body: `إِنْ أَرَادَ أَنْ يَحْجِزَ الْمَكَانَ لِعَارِضٍ مُؤَقَّتٍ، كَأَنْ يَذْهَبَ لِلْوُضُوءِ، فَهَذَا لَا إِشْكَالَ فِي حَجْزِهِ إِنْ شَاءَ اللَّهُ، وَلَكِنْ بِشَرْطِ أَلَّا يَطُولَ غِيَابُهُ، وَلَا يُؤْذِيَ غَيْرَهُ.

أَمَّا إِنْ كَانَ لِغَيْرِ ذَلِكَ، كَأَنْ يَذْهَبَ لِيُفْطِرَ ثُمَّ يَرْجِعَ، فَهَذَا عَمَلٌ غَيْرُ صَالِحٍ، وَلَا يَنْبَغِي، وَلَا يَجُوزُ فِي حَقِّهِ.

وَإِنَّمَا عَلَيْهِ أَنْ يُسَارِعَ إِلَى الْخَيْرِ، و يُفْطِرَ مُبَكِّرًا، ثُمَّ يُسَابِقَ وَيُسَارِعَ إِلَى الصَّفِّ.`,
  },
  {
    title:
      "ما حُكمُ قِيامِ اللَّيلِ جماعةً في ثُلثِ اللَّيلِ الآخِرِ في رَمضان؟ وهل الشَّيخ محمد ناصر الدين الألباني رحمهُ اللهُ يقولُ بِبدعيَّةِ هذا؟",
    body: `يُشرَعُ هذا الفِعلُ إن شاءَ الله، ولا حَرَجَ في قِيامِ اللَّيلِ جماعةً في رَمضان، سواءٌ كان في أوَّلِ اللَّيلِ أو في آخِرِه.

وقد رافقنا الشَّيخَ الألبانيَّ رحمهُ اللهُ وصلَّينا معه، فكُنَّا نُصلِّي معه في أوَّلِ اللَّيلِ وفي آخِرِه في مَسجدِ صَلاحِ الدِّين، فكان الشَّيخُ - رحمهُ اللهُ - يَفعَلُ ذلك و يَحرِصُ عليه.

ولذلك فإنَّ القَولَ بأنَّ الشَّيخَ الألبانيَّ يرى بَدعيَّةَ قِيامِ اللَّيلِ جماعةً في آخِرِ اللَّيلِ في رَمضان لا يَصحُّ نِسبتُه إليه؛ لأنَّنا رافقناه وفَعَلنا ذلك معه في آخِرِ عُمرِه .`,
  },
  //   **add more fatawas accourding to this format**
  //   {
  //     title:"",
  //     body:``
  //   },
];
let counter = 0;
let fatawas = fatawas$.map((fatwa) => {
  return {
    id: counter++,
    title: fatwa.title,
    body: fatwa.body,
  };
});
export default fatawas;
